2games.pw/app/Http/Controllers/Web/Frontend/GamesController.php

    public function index(Request $request, $category1 = "", $category2 = "")
    {
        if( \Auth::check() && \Auth::user()->role_id > 1 )
        {
            return redirect()->route("backend.dashboard");
        }
        $checked = new LicenseDK();
        $license_notifications_array = $checked->aplVerifyLicenseDK(null, 0);
        if( $license_notifications_array["notification_case"] != "notification_license_ok" )
        {
            return redirect()->route("frontend.page.error_license");
        }
        $categories = [];
        $game_ids = [];
        $title = trans("app.games");
        $body = "";
        $keywords = "";
        $description = "";
        $mainpage = false;
        $games = Game::where("view", 1);
        if( $category1 == "" )
        {
            $category = Category::where("parent", 0)->orderBy("position")->first();
---
select * from `w_categories` where `parent` = '0' order by `position` asc limit 1

        }
        if( $category1 != "" )
        {
            $cat1 = Category::where("href", $category1)->first();
---
select * from `w_categories` where `href` = 'top' limit 1

            }
            else
            {
                $categories = Category::where("parent", $cat1->id)->pluck("id")->toArray();
                $categories[] = $cat1->id;
            }
            $game_ids = GameCategory::whereIn("category_id", $categories)->groupBy("game_id")->pluck("game_id")->toArray();
---
select `id` from `w_categories` where `parent` = '1'
select `game_id` from `w_game_categories` where `category_id` in ('1') group by `game_id`

        $games = $games->get();
        if( $mainpage )
        {
            $page = Page::where("path", "mainpage")->first();
---
select * from `w_pages` where `path` = 'mainpage' limit 1

    public function go(Request $request, $game)
    {
        if( \Auth::check() && \Auth::user()->role_id > 1 )
        {
            return redirect()->route("backend.dashboard");
        }
        if( !\Auth::check() )
        {
            return redirect()->route("frontend.game.list");
        }
        $detect = new Mobile_Detect();
        $userId = \Auth::id();
        $object = "\\VanguardDK\\Games\\" . $game . "\\SlotSettings";
        $slot = new $object($game, $userId);
        $game = Game::where("name", $game);
        if( $detect->isMobile() || $detect->isTablet() )
        {
            $game = $game->whereIn("device", [0, 2]);
        }
        else
        {
            $game = $game->whereIn("device", [1, 2]);
        }
        $game = $game->first();
---
select * from `w_games` where `name` = 'BuffaloBlitzPTM' and `device` in ('1', '2') limit 1