2games.pw/app/Http/Controllers/Web/Frontend/PagesController.php

select * from `w_pages` where `path` = 'external.php' and `view` = '1' and `type` > '0' limit 1
---
    public function view($page)
    {
        $page = Page::where("path", $page)->where("view", 1)->where("type", ">", 0)->first();